#Напишите программу, которая запрашивает у пользователя последовательно день
#его рождения, месяц и год;

function getBirthday() {
  var day = document.getElementsByName("day")[0].value;
  var month = document.getElementsByName("month")[0].value;
  var year = document.getElementsByName("year")[0].value;
  
  var birthday = day + "." + month + "." + year;
  
  alert("Ваша дата рождения: " + birthday);
}

# Напишите функцию, которая определяет какому дню недели соответствует эта
#дата?
import datetime

def определить_день_недели(день, месяц, год):
    дата = datetime.date(год, месяц, день)
    день_недели = дата.strftime("%A")
    
    return день_недели

# Пример использования функции
день = 18
месяц = 5
год = 2002

день_недели = определить_день_недели(день, месяц, год)
print("День недели: " + день_недели)

#Напишите функцию, которая определяет - високосный это был год, или нет?
def определить_високосный_год(год):
    if год % 4 == 0 and (год % 100 != 0 or год % 400 == 0):
        return True
    else:
        return False

# Пример использования функции
год = int(input("Введите год: "))

if определить_високосный_год(год):
    print("Год", год, "является високосным.")
else:
    print("Год", год, "не является високосным.")

import datetime

#Напишите функцию, которая определяет сколько сейчас лет пользователю;
def определить_возраст():
    год_рождения = int(input("Введите год рождения: "))
    сегодня = datetime.date.today()
    возраст = сегодня.year - год_рождения
    
    return возраст

# Пример использования функции
возраст = определить_возраст()
print("Вам сейчас", возраст, "лет.")

#Реализуйте вывод в консоль даты рождения пользователя в формате дд мм гггг,
#где цифры прорисованы звёздочками (*), как на электронном табло.
day = input("Введите день вашего рождения: ")
month = input("Введите месяц вашего рождения: ")
year = input("Введите год вашего рождения: ")

formatted_day = day.replace("0", "*")
formatted_month = month.replace("0", "*")
formatted_year = year.replace("0", "*")

print("Вы родились", formatted_day, formatted_month, formatted_year)
